senserf/picos/PicOS/CC13XX/SAVED/rfprop_attempt.c
// The precomputed WOR interval (between consecutive activations of sniff)
// in RAT ticks
static uint32_t wor_wakeup_interval;

#endif /* WOR MODE */

static cc1350_rfparams_t params = {
//
// These are the parameters settable with PHYSOPT_SETPARAMS, see cc1350.h
//
	// Delay before the device goes off if the RX is off and the output
	// queue dries out. Also, the delay before WOR is activated after a
	// packet reception. Expressed in PicOS msecs.
	.offdelay	= RADIO_DEFAULT_OFFDELAY,
#if RADIO_WOR_MODE
	// The nominal inter-sniff interval in PicOS msecs
	.interval 	= RADIO_DEFAULT_WOR_INTERVAL,
	// RSS sniff expressed as an unbiased RSS reading (+128)
	.rss		= RADIO_DEFAULT_WOR_RSSI,
	// Using PQT?
	.pqt		= YES,
#endif
};

typedef struct {
		word	ps,	// prescale
			rw;	// rate word
		// The actual exact rate computed from the raw parameters, so
		// we don't have to compute it
		lword	rt;
} ratable_t;

static const ratable_t ratable [] = CC1350_RATABLE;

#define	NRATES	(sizeof (ratable)/sizeof (ratable_t))

// Pointer to the queue of reception buffers; this is shared with the WOR mode
#define	rbuffs 		(RF_cmdPropRx . pQueue)

// Reception statistics (can be extracted via PHYSOPT_ERROR)
static rfc_propRxOutput_t	rxstat;

// Events
static aword drvprcs, qevent, to_trigger;
// This can be any address
#define	txevent ((aword)&to_trigger)

// ============================================================================

#if 0
// A command to retrieve firmware version and stuff
static rfc_CMD_GET_FW_INFO_t	cmd_gfi = { .commandNo = CMD_GET_FW_INFO };
#endif

#if 0
// Ping command
static rfc_CMD_PING_t		cmd_pin = { .commandNo = CMD_PING };
#endif

// Command to start the RAT (timer)
static rfc_CMD_SYNC_START_RAT_t	cmd_srt = { .commandNo = CMD_SYNC_START_RAT };

#if RADIO_LBT_SENSE_TIME > 0

#if RADIO_LBT_CORR_PERIOD == 0
#define	ENABLE_CORR_LBT	0
#else
#define	ENABLE_CORR_LBT	1
#endif

// Command for carrier sense (LBT)
static volatile rfc_CMD_PROP_CS_t cmd_cs = {
		.commandNo = CMD_PROP_CS,
		// Chained to TX
		.pNextOp = (rfc_radioOp_t*) &RF_cmdPropTx,
		.startTime = 0,
		.startTrigger.triggerType = 0,	// Immediately
		.startTrigger.bEnaCmd = 0,
		.startTrigger.triggerNo = 0,
		.startTrigger.pastTrig = 0,
		// True means channel busy
		.condition.rule = COND_STOP_ON_TRUE,
		.condition.nSkip = 0,
		// Keep everything running, no matter what
		.csFsConf.bFsOffIdle = 0,
		.csFsConf.bFsOffBusy = 0,
		// What we measure
		.csConf.bEnaRssi = 1,
		.csConf.bEnaCorr = ENABLE_CORR_LBT,
		.csConf.operation = 0,	// EITHER (as opposed to AND)
		.csConf.busyOp = 1,	// End sensing when channel found busy
		.csConf.idleOp = 0,	// Continue when idle
		.csConf.timeoutRes = 0,	// Timeout on invalid = busy (not idle)
		// Converted from absolute to signed
		.rssiThr = (byte)(RADIO_LBT_RSSI_THRESHOLD - 128),
		.numRssiIdle = RADIO_LBT_RSSI_NIDLE,
		.numRssiBusy = RADIO_LBT_RSSI_NBUSY,
		.corrPeriod = RADIO_LBT_CORR_PERIOD,
		.corrConfig.numCorrInv = RADIO_LBT_CORR_NINVD,
		.corrConfig.numCorrBusy = RADIO_LBT_CORR_NBUSY,
		// How to end: time relative to start
		.csEndTrigger.triggerType = TRIG_REL_START,
		.csEndTrigger.bEnaCmd = 0,
		.csEndTrigger.triggerNo = 0,
		.csEndTrigger.pastTrig = 0,
		// Converted from milliseconds to RAT 4MHz ticks
		.csEndTime = (RADIO_LBT_SENSE_TIME * RAT_TICKS_PER_US * 1024),
	};
#endif /* RADIO_LBT_SENSE > 0 */

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)

#if RADIO_DEFAULT_POWER > 7
#error "S: PXOPTIONS requires RADIO_DEFAULT_POWER <= 7"
#endif

static rfc_CMD_SET_TX_POWER_t cmd_sp = {
		.commandNo = CMD_SET_TX_POWER
	};

#endif

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
// Accumulated backoff
static word	bckf_lbt = 0;
#define	update_bckf_lbt(v)	bckf_lbt += (v)
#else
#define	update_bckf_lbt(v)	CNOP
#endif
		
// As far as I can tell, the trim structure can be set up once (RF need not be
// powered on) and then written to RF core when it comes up, so I am splitting
// the operation into two parts ... we shall see
static rfTrim_t rfTrim;

// ============================================================================

static void issue_cmd (lword cmd) {
//
// Issue a command to the radio, wait for (immediate) status, detect low-level
// problems (no interrupts)
//
	int res;

#ifdef	DETECT_HANGUPS
	int cnt = DETECT_HANGUPS * 900;
#endif
	while (1) {
		if ((res = RFCDoorbellSendTo (cmd) & 0xff) == 0x01)
			return;
		// We ignore the (larger) status for now; do we need it?
		if (res != 0x86)
			// Some fundamental problem
			syserror (EHARDWARE, "rt1");
		// Otherwise it means: previous command not completed, so keep
		// trying
#ifdef	DETECT_HANGUPS
		if (cnt-- == 0) {
			diag ("HUP %lx %lx", cmd, res);
			syserror (EHARDWARE, "hang ic0");
		}
#endif
		udelay (1);
	}
}

static void issue_cmd_async (lword cmd) {
//
// Issue a dorbell command and don't wait
//
	HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
	HWREG(RFC_DBELL_BASE + RFC_DBELL_O_CMDR)     = cmd;
}

static void sync_cmd () {
	while (!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));
	HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
}

static void wait_cmd (rfc_radioOp_t *cmd, lword tstat, lword timeout) {
//
// Wait for a radio operation command to complete (for those commands for
// which we want to wait without involving interrupts)
//
	while (1) {
		if (cmd->status == tstat)
			// Target status reached
			return;
		if (timeout-- == 0) {
#ifdef DETECT_HANGUPS
			diag ("HUP %lx %lx %lx", cmd->commandNo,
				cmd->status, tstat);
#endif
			syserror (EHARDWARE, "rt2");
		}
		udelay (1);
	}
}

static void enable_event (aword ev) {
//
// Make the specified event trigger-able by an RF interrupt
//
	to_trigger = ev;
	RFCCpeIntClear (LWNONE);
	RFCCpe0IntEnable (RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE |
			RFC_DBELL_RFCPEIFG_BOOT_DONE |
				RFC_DBELL_RFCPEIEN_RX_OK |
					RFC_DBELL_RFCPEIEN_INTERNAL_ERROR);
}

// ============================================================================

static void rf_on () {
//
// Turn the radio on
//
	if (dstate & DSTATE_RFON)
		return;

	TIME_COLDSTART_ON;

