senserf/picos/PicOS/CC13XX/SAVED/rfprop_attempt.c
#ifdef	RADIO_PINS_ON
	// Any special pin settings?
	RADIO_PINS_ON;
#endif
	// ====================================================================

	// Make sure RAT is driven by RTC
	HWREGBITW (AON_RTC_BASE + AON_RTC_O_CTL, AON_RTC_CTL_RTC_UPD_EN_BITN) =
		1;

	// Power up the domain (there's no peripheral for RF)
	__pi_ondomain (PRCM_DOMAIN_RFCORE);

	// The default setting of OSC clock source is OSC_RCOSC_HF; we shall
	// revert to it when the radio is switched off
	OSCHF_TurnOnXosc();

	// ====================================================================

	issue_cmd_async (CMDR_DIR_CMD_2BYTE (RF_CMD0,
		RFC_PWR_PWMCLKEN_MDMRAM | RFC_PWR_PWMCLKEN_RFERAM));

	// Enable the clock
	RFCClockEnable ();

	sync_cmd ();

	// Apply the patches
	rf_patch_cpe_genfsk ();
	rf_patch_rfe_genfsk ();	

	// Undo the magic
        issue_cmd (CMDR_DIR_CMD_2BYTE (RF_CMD0, 0));

        // Initialize bus request; AFAICT, this is only needed if we want to
	// deep sleep while the radio is sending data to our RAM
	issue_cmd_async (CMDR_DIR_CMD_1BYTE (CMD_BUS_REQUEST, 1));

	RFCAdi3VcoLdoVoltageMode (true);

	// ====================================================================


	// This must be done with RF core on, on every startup
       	RFCRfTrimSet (&rfTrim);

	sync_cmd ();

	// ====================================================================

	// Make sure the clock is up
	while (!OSCHF_AttemptToSwitchToXosc ()) { udelay (50); }

	issue_cmd ((lword)&RF_cmdPropRadioDivSetup);
#if 0
	wait_cmd ((rfc_radioOp_t*)&RF_cmdPropRadioDivSetup, PROP_DONE_OK,
		10000);
	issue_cmd ((lword)&cmd_srt);
	issue_cmd ((lword)&RF_cmdFs);
#endif
	// The last command in chain
	wait_cmd ((rfc_radioOp_t*)&RF_cmdFs, DONE_OK, 10000);

#if 0
	// Show up the firmware version on first power up
	issue_cmd ((lword)&cmd_gfi);
	diag ("RF: %x %x %x %x",
					cmd_gfi.versionNo,
					cmd_gfi.startOffset,
					cmd_gfi.freeRamSz,
					cmd_gfi.availRatCh);
#endif
#if 0
	// Check connection?
	issue_cmd ((lword)&cmd_pin);
#endif
	_BIS (dstate, DSTATE_RFON);

	// Interrupts
	HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIEN) = 0;
	HWREG (RFC_DBELL_BASE+RFC_DBELL_O_RFCPEIFG) = 0;
	IntEnable (INT_RFC_CPE_0);

	LEDI (0, 1);

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
	bckf_lbt = 0;
#endif
	TIME_COLDSTART_OFF;
}

static void rx_de () {
//
// Deactivate the receiver
//
	if ((dstate & DSTATE_RXAC)) {
		issue_cmd (CMDR_DIR_CMD (CMD_ABORT));
		_BIC (dstate, DSTATE_RXAC | DSTATE_WORA);
		to_trigger = 0;
	}
}

static void rf_off () {
//
// Turn the radio off
//
	if ((dstate & DSTATE_RFON) == 0)
		return;

	TIME_COLDSTART_ON;

	rx_de ();

	IntDisable (INT_RFC_CPE_0);

	RFCAdi3VcoLdoVoltageMode (false);

	// Without this, the domain isn't truly switched off
	RFCSynthPowerDown ();

	RFCClockDisable ();

	__pi_offdomain (PRCM_DOMAIN_RFCORE);

	// Decouple RAT from RTC
	HWREGBITW (AON_RTC_BASE + AON_RTC_O_CTL, AON_RTC_CTL_RTC_UPD_EN_BITN) =
		0;

	OSCHF_SwitchToRcOscTurnOffXosc ();

#ifdef	RADIO_PINS_OFF
	RADIO_PINS_OFF;
#endif
	_BIC (dstate, DSTATE_RFON);
	LEDI (0, 0);

	TIME_COLDSTART_OFF;
}

#if RADIO_WOR_MODE

static void init_wor () {
//
// Initialize the structures for WOR operation (called once on startup)
//
	// The advertisement packet for waking transmissions
	memcpy (&cmd_ta, &RF_cmdPropTx, TX_ADV_HEADER_SIZE);

	cmd_ta . commandNo = CMD_PROP_TX_ADV;

	// These have a slightly different layout and they don't depend on
	// configurable parameters

	cmd_ta . syncWord = RF_cmdPropTx . syncWord;
	cmd_ta . pktConf . bFsOff = RF_cmdPropTx . pktConf . bFsOff;
	cmd_ta . pktConf . bUseCrc = RF_cmdPropTx . pktConf . bUseCrc;
	cmd_ta . preTrigger . triggerType = TRIG_REL_START;

	// For reception
	memcpy (&cmd_sn, &RF_cmdPropRx, sizeof (rfc_CMD_PROP_RX_t));

	cmd_sn . commandNo = CMD_PROP_RX_SNIFF;

	// General CS configuration; AND (as opposed to EITHER for LBT)
	cmd_sn . csConf . operation = 1;
	// Continue sense on channel busy (this is not LBT, we want to receive)
	cmd_sn . csConf . busyOp = 0;
	// End when idle (in contrast to LBT)
	cmd_sn . csConf . idleOp = 1;
	// Timeout with channel state invalid treated as idle
	cmd_sn . csConf . timeoutRes = 1;

	// One idle RSS sample signals idle
	cmd_sn . numRssiIdle = 1;
	// Number of busy RSS samples to declare busy
	cmd_sn . numRssiBusy = 1;

	// One PQT correlation allows transition invalid->busy
	cmd_sn . corrConfig . numCorrBusy = 1;
	// One PQT correlation allows transition idle->invalid
	cmd_sn . corrConfig . numCorrInv = 1;

	// Clear the autoloop bits, we will restart the command manually
	// after each event
	cmd_sn . pktConf . bRepeatOk = 0;
	cmd_sn . pktConf . bRepeatNok = 0;

	// End relatively to when started
	cmd_sn . endTrigger.triggerType = TRIG_REL_START;
	// Start at absolute time
	cmd_sn . startTrigger.triggerType = TRIG_ABSTIME;
	// Also trigger if running late
	cmd_sn . startTrigger.pastTrig = 1;
}

static void update_wor_params () {
//
// Recalculates the parameters for WOR that depend on other parameters
//
	uint32_t rt_per_bit;	// The rate: RAT ticks per bit

	// RSSI?
	if (params . rss != 0) {
		cmd_sn . csConf . bEnaRssi = 1;
		// Specified in unbiased form
		cmd_sn . rssiThr = (int8_t) params . rss - 128;
	} else {
		cmd_sn . csConf . bEnaRssi = 0;
	}

	// PQT?
	if (params . pqt != 0) {
		cmd_sn . csConf . bEnaCorr = 1;
		// I am not quite sure what I am doing here; this is copied
		// from the WOR example in simplelink
		cmd_sn . csEndTrigger . triggerType = TRIG_REL_START;
	} else {
		cmd_sn . csConf . bEnaCorr = 0;
		cmd_sn . csEndTrigger . triggerType = TRIG_NEVER;
	}

	// The number of RAT ticks per bit
	rt_per_bit = (RAT_TICKS_PER_US * 1000000UL) / ratable [vrate] . rt;

	// The requested duration of the wakeup interval (specified in PicOS
	// msecs) expressed in RAT ticks
	wor_wakeup_interval = ((uint32_t) params . interval *
		RAT_TICKS_PER_US * 1000000UL) / 1024;

	// The correlation period. Accounts for a preamble portion + sync word.
	// Time in which we expect to see numCorr correlation peaks of a
	// preamble + the sync word, so we don't stop before the end of the
	// sync word is detected
	cmd_sn . corrPeriod = (uint16_t)(
		// Sync word length in bits ...
		((uint16_t) RF_cmdPropRadioDivSetup.formatConf.nSwBits
		// ... plus the preamble bits
		+ CORR_PERIOD_SYM_MARGIN)
		// ... multiplied by the number of ticks in a bit
		* rt_per_bit);

	// Time to force a single check if a preamble is present at all, to
	// abort ASAP, if it isn't; the 150 copied from example
	cmd_sn . csEndTime = (uint32_t)(rt_per_bit * CS_END_TIME_MIN_TIME_SYM +
		 CS_END_TIME_MIN_TIME_STATIC_US * RAT_TICKS_PER_US);

	// The maximum time since trigger until a sync word is received
	cmd_sn . endTime = (uint32_t)(
		// The interval ...
		wor_wakeup_interval
		// ... plus the sync word bits
		+ ((uint32_t) RF_cmdPropRadioDivSetup.formatConf.nSwBits
		// ... plus a few bits thrown in just in case
		+ RX_END_TIME_SYM_MARGIN)
		// ... multiplied by the number of ticks in a bit
		* rt_per_bit);

	// For the transmitted (ADV) packet the interval is un-adjusted. The
	// preamble length is strictly equal to the period.
	cmd_ta . preTime = wor_wakeup_interval;

	// Adjust the wakeup interval for reception to make it a bit shorter;
	// in the example they take 0.5% of a second (20000 RAT TICKS)
	wor_wakeup_interval -= WOR_INTERVAL_ADJUSTMENT_US * RAT_TICKS_PER_US;
}

#endif	/* WOR MODE */

static void rx_ac () {
//
// Activate the receiver
//
	rfc_dataEntryGeneral_t *re;
	int i;

	// One hard prereq
	rf_on ();
	if (dstate & DSTATE_RXAC)
		// Don't touch anything if RX is active. Note that in order to
		// switch to WOR, the driver has to kill the RX first, if it
		// happens to be active (see DR_LOOP where such state changes
		// are recognized and handled)
		return;

	// Make sure the buffers are clean
	for (re = (rfc_dataEntryGeneral_t*) (rbuffs->pCurrEntry), i = 0;
    	    i < NRBUFFS; i++, re = (rfc_dataEntryGeneral_t*)(re->pNextEntry))
			re->status = DATA_ENTRY_PENDING;
#if RADIO_WOR_MODE
	if (dstate_wor_rq) {
		// We are turning on the WOR mode; get the current RAT time
		cmd_sn . startTime = (uint32_t)
			HWREG (RFC_RAT_BASE + RFC_RAT_O_RATCNT);
		// The command will be issued in rx_int_enable
		// issue_cmd ((lword)&cmd_sn);
		_BIS (dstate, DSTATE_RXAC | DSTATE_WORA);
		return;
	}
#endif
	// Regular mode
	_BIS (dstate, DSTATE_RXAC);
	issue_cmd ((lword)&RF_cmdPropRx);
}

static void plugch () {
//
// Insert the channel number as the right frequency in the proper place
//
	RF_cmdFs.frequency = 
		// Channel number is just the megahertz increment
		RF_cmdPropRadioDivSetup.centerFreq = CC1350_BASEFREQ + channel;
}

#if RADIO_BITRATE_INDEX > 0

static void plugrt () {
//
// Insert the rate parameters
//
	RF_cmdPropRadioDivSetup.symbolRate.preScale = ratable [vrate] . ps;
	RF_cmdPropRadioDivSetup.symbolRate.rateWord = ratable [vrate] . rw;
}

#endif

